# SPEC-2 Homelab (Cisco ISR4331 + Catalyst 3560 + Catalyst 2960)

**Author:** Patrick Furtado

## Overview
This repository contains a step-by-step, text-only lab guide for building the **SPEC-2 Homelab** using Cisco ISR4331 (router), Catalyst 3560 (core switch), Catalyst 2960 (access switch) and two workstation PCs. The guide is intended to be followed line-by-line from console/SSH. All configuration examples are provided in CLI format with inline explanation comments using `!`.

**Note:** This README contains all step-by-step commands and short descriptions so you can perform the lab directly from the README or copy blocks into your terminal. No diagrams or tables are included — only text and CLI blocks.

---

## Equipment (short list)
- Cisco ISR4331 router
- Cisco Catalyst 3560 core switch
- Cisco Catalyst 2960 access switch
- 2x PCs (Windows/Linux)
- Spectrum ISP modem (or simulated WAN)
- Cat5e/Cat6 patch cables (straight-through)
- Cisco console cable (RJ45→DB9 rollover) or USB console cable
- USB→Serial adapter if needed
- PuTTY (or another terminal emulator)

---

## Physical Cabling & Ports (step-by-step description)
1) Connect the Spectrum/ISP modem to the router WAN interface:
```
Spectrum ISP modem -> ISR4331 GigabitEthernet0/0/0
```
Use a Cat5e/Cat6 straight-through patch cable.

2) Connect the router LAN uplink to the core switch (routed link):
```
ISR4331 GigabitEthernet0/0/1 -> Core 3560 GigabitEthernet0/1
```
Use a straight-through patch cable. This link is configured as a routed interface (no switchport) on the core.

3) Connect the core switch to the access switch (trunk):
```
Core 3560 GigabitEthernet0/2 -> Access 2960 GigabitEthernet0/1
```
Use a straight-through cable. Configure as 802.1Q trunk allowing VLAN 10 and 20.

4) Connect PCs to access switch access ports:
```
Access 2960 GigabitEthernet0/2 -> PC1 NIC  (VLAN 20)
Access 2960 GigabitEthernet0/3 -> PC2 NIC  (VLAN 20)
```

5) Console connections for initial setup:
```
Laptop -> device console port (RJ45->DB9 rollover or USB console cable)
PuTTY (Serial): COM# | 9600 | 8 | None | 1 | Flow: None
```

Power-up order: Core (3560) -> Access (2960) -> Router (ISR4331) -> PCs

---

## PuTTY / Console Quick Setup (concise)
- SSH: Host = management IP (example 192.168.10.1), Port = 22, Protocol = SSH. Login with `admin` user and configured secret.
- Serial: Connection type = Serial, Serial line = COM#, Speed = 9600, Data bits = 8, Parity = None, Stop bits = 1, Flow control = None.

CLI examples for getting into privileged mode after login:
```
enable
```

---

# Step-by-step Configuration & Descriptions (follow sequence)

> Apply these commands in order. Each block is prefixed by the device where it should be executed.

---

## Step 1 — Core Switch (Catalyst 3560) Base Configuration
**Description:** Set hostname, secure enable secret, configure domain for SSH, create local admin user, generate RSA keys, enable SSH v2, configure console and VTY for secure access, and save configuration.

```
CORE-SW> enable
CORE-SW# configure terminal
CORE-SW(config)# hostname CORE-SW
! Set device hostname for identification

CORE-SW(config)# enable secret class
! Set encrypted enable password for privileged EXEC mode

CORE-SW(config)# ip domain-name homelab.local
! Required for generating SSH keys

CORE-SW(config)# username admin privilege 15 secret cisco123
! Creates local admin account with highest privileges

CORE-SW(config)# crypto key generate rsa
! Generates RSA keypair for SSH
How many bits in the modulus [512]: 1024
! 1024-bit key (sufficient for lab use)

CORE-SW(config)# ip ssh version 2
! Enables SSH protocol version 2 (more secure)

CORE-SW(config)# line vty 0 4
CORE-SW(config-line)# login local
! Use local username for SSH login
CORE-SW(config-line)# transport input ssh
! Restrict remote access to SSH only

CORE-SW(config)# line console 0
CORE-SW(config-line)# logging synchronous
! Prevent log messages from interrupting CLI
CORE-SW(config-line)# exec-timeout 10 0
! Auto-logout after 10 minutes of inactivity
CORE-SW(config-line)# password consolepass
! Set console password
CORE-SW(config-line)# login
! Enable password prompt for console

CORE-SW(config)# exit
CORE-SW# write memory
! Save running configuration to startup-config
```

---

## Step 2 — Access Switch (Catalyst 2960) Base Configuration
**Description:** Mirror access switch base security and management settings similar to core, prepare for VLANs and trunking.

```
ACCESS-SW> enable
ACCESS-SW# configure terminal
ACCESS-SW(config)# hostname ACCESS-SW
! Set device hostname for identification

ACCESS-SW(config)# enable secret class
! Set encrypted enable password for privileged EXEC mode

ACCESS-SW(config)# ip domain-name homelab.local
! Required for generating SSH keys

ACCESS-SW(config)# username admin privilege 15 secret cisco123
! Creates local admin account with highest privileges

ACCESS-SW(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
ACCESS-SW(config)# ip ssh version 2
ACCESS-SW(config)# line vty 0 4
ACCESS-SW(config-line)# login local
ACCESS-SW(config-line)# transport input ssh
ACCESS-SW(config)# line console 0
ACCESS-SW(config-line)# logging synchronous
ACCESS-SW(config-line)# exec-timeout 10 0
ACCESS-SW(config-line)# password consolepass
ACCESS-SW(config-line)# login
ACCESS-SW(config)# exit
ACCESS-SW# write memory
! Save configuration
```

---

## Step 3 — Router (ISR4331) Base Configuration
**Description:** Set router hostname, local admin user, generate RSA keys, enable SSH, configure console/VTY, and save.

```
Router> enable
Router# configure terminal
Router(config)# hostname ISR4331
! Set router hostname

ISR4331(config)# enable secret class
! Set encrypted enable password

ISR4331(config)# ip domain-name homelab.local
! Domain required for RSA key creation

ISR4331(config)# username admin privilege 15 secret cisco123
! Local admin account

ISR4331(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable... [OK]
! RSA keys created

ISR4331(config)# ip ssh version 2
! Enable SSH v2

ISR4331(config)# line vty 0 4
ISR4331(config-line)# login local
ISR4331(config-line)# transport input ssh

ISR4331(config)# line console 0
ISR4331(config-line)# logging synchronous
ISR4331(config-line)# exec-timeout 10 0
ISR4331(config-line)# password consolepass
ISR4331(config-line)# login

ISR4331(config)# exit
ISR4331# write memory
! Save configuration
```

---

## Step 4 — VLANs and SVIs on the Core (Inter-VLAN Routing)
**Description:** Create VLANs, define management and workstation SVIs, enable routing, and prepare trunk to access switch.

```
CORE-SW# configure terminal
CORE-SW(config)# vlan 10
CORE-SW(config-vlan)# name MANAGEMENT
CORE-SW(config-vlan)# exit

CORE-SW(config)# vlan 20
CORE-SW(config-vlan)# name WORKSTATIONS
CORE-SW(config-vlan)# exit

CORE-SW(config)# interface Vlan10
CORE-SW(config-if)# ip address 192.168.10.1 255.255.255.0
CORE-SW(config-if)# no shutdown
CORE-SW(config-if)# description Management VLAN SVI
CORE-SW(config-if)# exit

CORE-SW(config)# interface Vlan20
CORE-SW(config-if)# ip address 192.168.20.1 255.255.255.0
CORE-SW(config-if)# no shutdown
CORE-SW(config-if)# description Workstations VLAN SVI
CORE-SW(config-if)# exit

CORE-SW(config)# ip routing
! Enable layer-3 switching for inter-VLAN routing
```

---

## Step 5 — Trunk and Access Port Configuration (Core & Access Switch)
**Description:** Configure trunk on core->access link and configure access ports for PCs.

**Core (3560) trunk config:**
```
CORE-SW(config)# interface GigabitEthernet0/2
CORE-SW(config-if)# switchport trunk encapsulation dot1q
CORE-SW(config-if)# switchport mode trunk
CORE-SW(config-if)# switchport trunk allowed vlan 10,20
CORE-SW(config-if)# description Trunk to ACCESS-SW Gi0/1
CORE-SW(config-if)# no shutdown
CORE-SW(config-if)# exit
```

**Access (2960) trunk and access ports:**
```
ACCESS-SW(config)# interface GigabitEthernet0/1
ACCESS-SW(config-if)# switchport mode trunk
ACCESS-SW(config-if)# switchport trunk allowed vlan 10,20
ACCESS-SW(config-if)# description Uplink to CORE Gi0/2
ACCESS-SW(config-if)# no shutdown
ACCESS-SW(config-if)# exit

ACCESS-SW(config)# interface GigabitEthernet0/2
ACCESS-SW(config-if)# switchport mode access
ACCESS-SW(config-if)# switchport access vlan 20
ACCESS-SW(config-if)# description PC1 Workstation VLAN 20
ACCESS-SW(config-if)# spanning-tree portfast
ACCESS-SW(config-if)# no shutdown
ACCESS-SW(config-if)# exit

ACCESS-SW(config)# interface GigabitEthernet0/3
ACCESS-SW(config-if)# switchport mode access
ACCESS-SW(config-if)# switchport access vlan 20
ACCESS-SW(config-if)# description PC2 Workstation VLAN 20
ACCESS-SW(config-if)# spanning-tree portfast
ACCESS-SW(config-if)# no shutdown
ACCESS-SW(config-if)# exit
```

---

## Step 6 — Router Uplink and DHCP for VLAN20
**Description:** Configure router-side LAN uplink, WAN interface, DHCP pool for VLAN20 and default route to ISP.

```
ISR4331# configure terminal
ISR4331(config)# interface GigabitEthernet0/0/1
ISR4331(config-if)# ip address 192.168.30.1 255.255.255.252
ISR4331(config-if)# description Link to CORE-SW Gi0/1
ISR4331(config-if)# no shutdown
ISR4331(config-if)# exit

ISR4331(config)# interface GigabitEthernet0/0/0
ISR4331(config-if)# ip address dhcp
ISR4331(config-if)# description WAN to Spectrum ISP
ISR4331(config-if)# no shutdown
ISR4331(config-if)# exit

ISR4331(config)# ip dhcp excluded-address 192.168.20.1 192.168.20.10
ISR4331(config)# ip dhcp pool VLAN20-WORKSTATIONS
ISR4331(dhcp-config)# network 192.168.20.0 255.255.255.0
ISR4331(dhcp-config)# default-router 192.168.20.1
ISR4331(dhcp-config)# dns-server 8.8.8.8 8.8.4.4
ISR4331(dhcp-config)# domain-name homelab.local
ISR4331(dhcp-config)# lease 2
ISR4331(dhcp-config)# exit

ISR4331(config)# ip route 0.0.0.0 0.0.0.0 GigabitEthernet0/0/0
! Default route to ISP via WAN interface

ISR4331# write memory
! Save configuration
```

**Note:** If DHCP requests from VLAN20 do not reach the router because of your physical/routed setup, you may need `ip helper-address` on the Core SVI for VLAN20 pointing to 192.168.30.1. Only configure helper if necessary in your environment.

---

## Step 7 — PC IP Setup & Validation
**Description:** Configure PC IPs either statically or via DHCP. Examples below use static addressing.
**PC1:**
```
IP Address: 192.168.20.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.20.1
DNS: 8.8.8.8
```
**PC2:**
```
IP Address: 192.168.20.11
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.20.1
DNS: 8.8.8.8
```

Windows command-line validation examples:
```
ipconfig /all
ping 192.168.20.11
ping 192.168.10.1
tracert 8.8.8.8
arp -a
```

---

## Step 8 — Verification Commands & Expected Outputs
**Description:** Run these verification commands on each device after configuration. Expected outputs are provided as examples.

**Core Switch:**
```
CORE-SW# show ip interface brief
! Expect Vlan10 = 192.168.10.1 up/up and Vlan20 = 192.168.20.1 up/up
```
```
CORE-SW# show vlan brief
! Expect VLAN 10 (MANAGEMENT) and VLAN 20 (WORKSTATIONS) listed
```
```
CORE-SW# show interfaces trunk
! Expect trunk Gi0/2 to be trunking and allowing VLAN 10,20
```
**Access Switch:**
```
ACCESS-SW# show vlan brief
ACCESS-SW# show interfaces status
ACCESS-SW# show running-config interface GigabitEthernet0/2
```
**Router:**
```
ISR4331# show ip interface brief
ISR4331# show ip route
ISR4331# show ip dhcp binding
```
**PCs:**
```
C:\> ipconfig /all
C:\> ping 192.168.20.11
C:\> ping 192.168.10.1
C:\> tracert 8.8.8.8
```

Expected example (PC pinging another PC):
```
Pinging 192.168.20.11 with 32 bytes of data:
Reply from 192.168.20.11: bytes=32 time<1ms TTL=128
```

---

## Step 9 — Saving Configurations (local only)
**Description:** Save running configurations to startup-config to persist across reloads.

**Switches:**
```
CORE-SW# write memory
Building configuration...
[OK]

ACCESS-SW# write memory
Building configuration...
[OK]
```
**Router:**
```
ISR4331# copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

Verify with:
```
show startup-config
```

---

## Step 10 — Troubleshooting (common issues & fixes)
**Description:** Quick troubleshooting steps and commands to diagnose common issues encountered in this lab.

1) VLAN/Trunk Mismatch or Missing VLANs:
- Symptoms: Hosts in VLAN 20 cannot reach gateway or each other.
- Commands to run:
```
CORE-SW# show vlan brief
ACCESS-SW# show vlan brief
CORE-SW# show interfaces trunk
ACCESS-SW# show interfaces status
```
- Fix example:
```
ACCESS-SW(config)# interface GigabitEthernet0/1
ACCESS-SW(config-if)# switchport mode trunk
ACCESS-SW(config-if)# switchport trunk allowed vlan 10,20
ACCESS-SW# write memory
```

2) Inter-VLAN Routing Not Working:
- Symptoms: SVIs up but no routing between VLANs.
- Check and fix:
```
CORE-SW# show ip interface brief
CORE-SW# show ip route
CORE-SW(config)# ip routing
CORE-SW# write memory
```

3) SSH Fails to Connect:
- Symptoms: Connection refused or authentication fails.
- Commands to check:
```
CORE-SW# show ip ssh
CORE-SW# show running-config | section line vty
```
- Fix example:
```
CORE-SW(config)# ip domain-name homelab.local
CORE-SW(config)# crypto key generate rsa modulus 1024
CORE-SW(config)# ip ssh version 2
CORE-SW(config)# username admin privilege 15 secret cisco123
CORE-SW(config)# line vty 0 4
CORE-SW(config-line)# login local
CORE-SW(config-line)# transport input ssh
CORE-SW# write memory
```

4) Exec-timeout / Console disconnects too quickly:
```
CORE-SW(config)# line console 0
CORE-SW(config-line)# exec-timeout 15 0
CORE-SW# write memory
```

5) No Internet from PCs (ping 8.8.8.8 fails):
- Check router default route and NAT (if using private addressing via ISP):
```
ISR4331# show ip route
ISR4331# show ip nat translations
ISR4331(config)# ip nat inside source list 1 interface GigabitEthernet0/0/0 overload
```
(Configure NAT only if connecting private addresses to the public WAN)

---

## Appendix — Full Device Running-Config Examples (for reference)
**Core (3560) - example final running-config:**
```
! --- CORE-SW Running Configuration ---
hostname CORE-SW
enable secret class
ip domain-name homelab.local
username admin privilege 15 secret cisco123
!
ip routing
!
interface Vlan10
 ip address 192.168.10.1 255.255.255.0
 no shutdown
!
interface Vlan20
 ip address 192.168.20.1 255.255.255.0
 no shutdown
!
interface GigabitEthernet0/1
 no switchport
 ip address 192.168.30.2 255.255.255.252
 description Link to ISR4331 Gi0/0/1
 no shutdown
!
interface GigabitEthernet0/2
 switchport trunk encapsulation dot1q
 switchport mode trunk
 switchport trunk allowed vlan 10,20
 description Trunk to ACCESS-SW Gi0/1
 no shutdown
!
line vty 0 4
 login local
 transport input ssh
!
line console 0
 logging synchronous
 exec-timeout 10 0
 password consolepass
 login
!
end
write memory
```

**Access (2960) - example final running-config:**
```
! --- ACCESS-SW Running Configuration ---
hostname ACCESS-SW
enable secret class
ip domain-name homelab.local
username admin privilege 15 secret cisco123
!
interface GigabitEthernet0/1
 switchport mode trunk
 switchport trunk allowed vlan 10,20
 description Uplink to CORE-SW Gi0/2
 no shutdown
!
interface GigabitEthernet0/2
 switchport mode access
 switchport access vlan 20
 spanning-tree portfast
 description PC1 Workstation VLAN 20
 no shutdown
!
interface GigabitEthernet0/3
 switchport mode access
 switchport access vlan 20
 spanning-tree portfast
 description PC2 Workstation VLAN 20
 no shutdown
!
line vty 0 4
 login local
 transport input ssh
!
line console 0
 logging synchronous
 exec-timeout 10 0
 password consolepass
 login
!
end
write memory
```

**Router (ISR4331) - example final running-config:**
```
! --- ISR4331 Running Configuration ---
hostname ISR4331
enable secret class
ip domain-name homelab.local
username admin privilege 15 secret cisco123
!
interface GigabitEthernet0/0/1
 ip address 192.168.30.1 255.255.255.252
 description Link to CORE-SW Gi0/1
 no shutdown
!
interface GigabitEthernet0/0/0
 ip address dhcp
 description WAN link to ISP
 no shutdown
!
ip dhcp excluded-address 192.168.20.1 192.168.20.10
ip dhcp pool VLAN20-WORKSTATIONS
 network 192.168.20.0 255.255.255.0
 default-router 192.168.20.1
 dns-server 8.8.8.8 8.8.4.4
 domain-name homelab.local
 lease 2
!
ip route 0.0.0.0 0.0.0.0 GigabitEthernet0/0/0
!
line vty 0 4
 login local
 transport input ssh
!
line console 0
 logging synchronous
 exec-timeout 10 0
 password consolepass
 login
!
end
write memory
```

---

If you want any section trimmed for brevity, or expanded with additional step-by-step verification examples (e.g., exact expected `show` outputs per command), tell me specifically which section(s) to expand or shorten and I will update the README file immediately.
